Revit 2016 API
TaskDialogShowingEventArgs.DialogId Property
 String ID associated with the task dialog.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2010
Syntax
C#
public string DialogId { get; }
Visual Basic
Public ReadOnly Property DialogId As String
	Get
Visual C++
public:
property String^ DialogId {
	String^ get ();
}
See Also
TaskDialogShowingEventArgs Class
Autodesk.Revit.UI.Events Namespace